# WeldDefinition

Weld definition for cut operations (web or flange weld).

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**thickness** | **float** | Thickness of the weld - value 0 &#x3D; recommended size | [optional]
**weld_type** | **WeldType** |  | [optional]
**weld_material** | **ReferenceElement** |  | [optional]

## Example

```python
from ideastatica_connection_api.models.weld_definition import WeldDefinition

# TODO update the JSON string below
json = "{}"
# create an instance of WeldDefinition from a JSON string
weld_definition_instance = WeldDefinition.from_json(json)
# print the JSON string representation of the object
print(weld_definition_instance.to_json())

# convert the object into a dict
weld_definition_dict = weld_definition_instance.to_dict()
# create an instance of WeldDefinition from a dict
weld_definition_from_dict = WeldDefinition.from_dict(weld_definition_dict)
```
[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)